export const GlobalColor = {
  Black1: '#333333', // 通常のテキスト
  Black2: '#595757', // フッター テキストリンク
  Black3: '#474747', // カウントダウンタイマー 背景

  Blue1: '#00337f', // ヘッダー border-topなど
  Blue2: '#0073be', // ヘッダー 背景 h4背景(SP)
  Blue3: '#46b8ff', // ヘッダー headerSpNavi border
  Blue4: '#355a89', // ヘッダー gnaviInner border
  Blue5: '#194e9e', // フッター 注意事項背景
  Blue6: '#3e6398', // 擬似要素の矢印(PC)
  Blue7: '#3888bb', // サイドバー h3見出し背景
  Blue8: '#1a589a', // メインビジュアル h2タイトル
  Blue9: '#02387e', // メインビジュアル テキスト
  Blue10: '#0b356f', // 擬似要素の矢印(SP)
  Blue11: '#194476', // h2 背景 グラデーション トップ
  Blue12: '#002b6d', // h2 背景 グラデーション ボトム
  Blue13: '#e1f9ff', // 画像付きリンク 背景色
  Blue14: '#c3eff8', // 画像付きリンク 背景ホバー
  Blue15: '#f3faff', // アピールポイント 背景
  Blue16: '#0000ff', // カウントダウンタイマー テキスト強調
  Blue17: '#0067b7', // エリア 見出し背景
  Blue18: '#143e72', // グローバルナビ 背景 トップ
  Blue19: '#042f6e', // グローバルナビ 背景 ボトム
  Blue20: '#38b0e3', // ペイバックシミュレーション 結果ボーター
  Blue21: '#41b8ef', // ペイバックシミュレーション 結果タイトル 背景 トップ
  Blue22: '#5acceb', // ペイバックシミュレーション 結果タイトル 背景 ボトム
  Blue23: '#e1f4f5', // ペイバックシミュレーション 結果テキスト 背景 レフト
  Blue24: '#ebf7ff', // 市区町村オリジナルテキスト 背景色

  Brown1: '#723e0a', //ランキング テーブル見出し
  Brown2: '#ae8e7e', //ランキング 順位 3位 border
  Brown3: '#feebd1', //ランキング 順位 3位 背景
  Brown4: '#6f3905', //ペイバックシミュレーション 見出し

  Gray1: '#cccccc', // 通常のborderなど
  Gray2: '#e8e8e8', // フッター footerTop 背景など
  Gray3: '#aaaaaa', // 濃いborder
  Gray4: '#757373', // 擬似要素 矢印
  Gray5: '#f5f5f5', // ランキング dt背景
  Gray6: '#999999', // メインビジュアル h1
  Gray7: '#fcfcfc', // メインビジュアル h1背景
  Gray8: '#9da1ae', // ランキング 順位 2位 border
  Gray9: '#666666', // カウントダウンタイマー テキスト
  Gray10: '#f1f1f1', // ランキング 順位 2位 背景
  Gray11: '#eeeef0', // タイマー背景
  Gray12: '#afafaf', // サイドバーランキング 2位 グラデーション1
  Gray13: '#777777', // サイドバーランキング 2位 グラデーション2
  Gray14: '#e5eaf1', // かんたん3step 背景

  Green1: '#bfd255', // お問い合わせ 送信するボタン 背景
  Green2: '#8eb92a', // お問い合わせ 送信するボタン グラデーション1
  Green3: '#72aa00', // お問い合わせ 送信するボタン グラデーション2
  Green4: '#9ecb2d', // お問い合わせ 送信するボタン グラデーション3

  Orange1: '#fb7f00', //ランキング テーブルボーダー
  Orange2: '#fbe8b5', //ランキング テーブル見出し背景
  Orange3: '#ffffe2', //ランキング 総合評価 リスト背景
  Orange4: '#fbca23', //ランキング 順位 1位 border
  Orange5: '#fffad9', //ランキング 順位 1位 背景
  Orange6: '#ffa84c', //ボタン グラデーション
  Orange7: '#faebc4', // ペイバックシミュレーション 入力ラベル背景
  Orange8: '#f4a377', // サイドバーランキング 3位 グラデーション1
  Orange9: '#d58153', // サイドバーランキング 3位 グラデーション2
  Orange10: '#ffc088', // レビュー リスト背景
  Orange11: '#ffefe1', // レビュー テーブル背景
  Orange12: '#ff7200', // 強調テキスト
  Orange13: '#ff9824', // 業者検索結果 業者名見出し 背景

  Red1: '#f31414', // サイド ボタン
  Red2: '#c30404', // リンクホバー メインビジュアル 「徹底比較」テキスト
  Red3: '#da0000', // 強調
  Red4: '#e64c4c', // ポイント 見出し背景

  White: '#ffffff',

  Yellow1: '#ffff00', //カウントダウンタイマー 数字
  Yellow2: '#fff089', //下線border
  Yellow3: '#fffcef', // ペイバックシミュレーション テーブル見出し 背景
  Yellow4: '#f1c924', // サイドバーランキング 1位 グラデーション1
  Yellow5: '#c7a816', // サイドバーランキング 1位 グラデーション2
  Yellow6: '#fffc99', // おすすめ グラデーション 背景
}
